{
    "version": "https://jsonfeed.org/version/1",
    "title": "GamertechAU",
    "description": "",
    "home_page_url": "https://www.gamertechau.com",
    "feed_url": "https://www.gamertechau.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "GamertechAU"
    },
    "items": [
        {
            "id": "https://www.gamertechau.com/posts/elroy-and-the-aliens/",
            "url": "https://www.gamertechau.com/posts/elroy-and-the-aliens/",
            "title": "Elroy and the Aliens",
            "summary": "A charming point-and-click adventure Name Elroy and the Aliens Completed on 2025-04-07&hellip;",
            "content_html": "<h2>A charming point-and-click adventure</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: hidden;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Elroy and the Aliens</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-04-07</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">Motiviti</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">Motiviti</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>After originally being introduced to Elroy and the Aliens by the developers on Bluesky, I had to play it. Point-and-click adventure games aren't usually my thing (though I have played a fair few), but the game looked fun and the demo cemented it.</p>\n<p>In Elroy and the Aliens you play Elroy, a young engineer/inventor and Peggy, an investigative reporter initially there to interview him. After a technical demonstration goes awry, the two begin an adventure that will take them across Earth and beyond to rescue Elroy's long-lost father.</p>\n<p>The story and progression is very well done, and the humour throughout is excellent. Some of the steps required to progress took me a little bit, but they're all logical and the game is pretty good at telling you what people need, just need to remember them.</p>\n<p>The point-and-click mechanics are the usual system. The player searches scenes for needed items, talks to characters for information and can combine several items to achieve the goal. If you need it, there's a hotkey to highlight areas in the scene you can interact with, though there's an achievement for not using it throughout the play through.</p>\n<p>There's a ton of secrets and challenge achievements to unlock, multiple endings and plenty of puzzles to figure out.</p>\n<p>The game ran perfectly out of the box with no noticeable bugs and even had a native Linux client which was greatly appreciated. The graphics were excellent, hand-drawn to extremely high detail and the audio was on point.</p>\n<p>If you're a fan of point-and-click adventure games this is definitely a game to consider. One ending with definitely not finding all the secrets and achievements took 8.6 hours on stream.</p>",
            "image": "https://www.gamertechau.com/media/posts/48/Elroy_and_the_Aliens.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Indie",
                   "Completed Games"
            ],
            "date_published": "2025-04-07T16:03:16+10:00",
            "date_modified": "2025-05-10T13:41:57+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/lost-in-play/",
            "url": "https://www.gamertechau.com/posts/lost-in-play/",
            "title": "Lost in Play",
            "summary": "Engaging puzzle game Name Lost in Play Completed on 2025-03-31 Developers Happy&hellip;",
            "content_html": "<h2>Engaging puzzle game</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: hidden;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Lost in Play</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-03-31</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">Happy Juice Games</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">Joystick Ventures</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>Been meaning to play this cute little puzzle game for a while now, and glad I did as it was excellent.</p>\n<p>Lost in Play is a charming puzzle adventure game where you explore the imaginations of two siblings (Toto and Gal) as they play together, looking for a way back home. During the playthrough you'll encounter many unique characters who all have something to contribute to your adventure.</p>\n<p>As you explore different areas, you find objects and how to use them point-and-click adventure style, and complete a large range of wild puzzles and minigames to further the story with plenty of well-done references throughout it.</p>\n<p>It's completely family friendly and can be played using a controller, keyboard or mouse for easy preference and accessibility. It can also run on a potato while still having a fantastic and high quality art style.</p>\n<p>Lost in Play ran perfectly with no technical issues. One gripe was the settings were inaccessible until you actually started the play through, with volume defaulting to 100%, so its loud with no opportunity to set it to a sane level before the opening cutscene.</p>\n<p>Highly recommend giving Lost in Play a go if you're looking for a chill game that's slightly brain-melty. One playthrough took 4.8 hours on stream.</p>",
            "image": "https://www.gamertechau.com/media/posts/47/LostInPlay.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Indie",
                   "Completed Games"
            ],
            "date_published": "2025-03-31T16:38:35+11:00",
            "date_modified": "2025-05-04T12:27:18+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/crime-scene-cleaner/",
            "url": "https://www.gamertechau.com/posts/crime-scene-cleaner/",
            "title": "Crime Scene Cleaner",
            "summary": "Unique job opportunity Name Crime Scene Cleaner Completed on 2025-03-28 Developers President&hellip;",
            "content_html": "<h2>Unique job opportunity</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: hidden;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Crime Scene Cleaner</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-03-28</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">President Studio</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">President Studio / PlayWay S.A.</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>Crime Scene Cleaner is a fun and chill game. You play a father employed as an underpaid high-school janitor who desperately needs an additional income source to pay for his daughters specialist (US) medical bills as the insurance company sure wont.</p>\n<p>Doing a quick job helping out a 'friend' leads to a high-paying but extremely risky career cleaning up crime scenes and destroying evidence for a brutal mob leader. After 'Big Jim' is finished making a mess, your job is to go in, clean up the blood, bullet casings and of course bodies, clean and reposition all the furniture and remove any evidence of criminal activity at the site. Also any valuables as their previous owners no longer need them and you've got bills to pay.</p>\n<p>As you progress, you earn skill points to unlock new tools and upgrades. You can leave maps partially completed, however the better the job you do, the more skill points you earn. Each map contains music tapes that unlock an in-game track and multiple secret areas with bonus loot and often an interesting story element. Once a map's completed, you can easily go back and do it again to find missed secrets and benefit from equipment upgrades.</p>\n<p>I don't believe there's any failure state for the game as just completing the primary objectives on each map is enough to progress, though you will of course miss the completion bonus.</p>\n<p>Tech-wise the game ran perfectly with no graphical, audio or performance issues and has a platinum rating on ProtonDB. The devs also took care of a pet peeve of mine and defaulted the audio to 50%, instead of blasting players with 100% volume.</p>\n<p>If you're after a chill (and slightly creepy) cleaning sim, I definitely recommend Crime Scene Cleaner. The play through took 11 hours. Also, you can pat the doggo.</p>",
            "image": "https://www.gamertechau.com/media/posts/46/Crime-Scene-Cleaner.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Indie",
                   "Completed Games"
            ],
            "date_published": "2025-03-28T16:01:04+11:00",
            "date_modified": "2025-05-04T12:28:40+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/conkers-bad-fur-day/",
            "url": "https://www.gamertechau.com/posts/conkers-bad-fur-day/",
            "title": "Conker&#x27;s Bad Fur Day",
            "summary": "Blast from the past Name Conker's Bad Fur Day Completed on 2025-03-21&hellip;",
            "content_html": "<h2>Blast from the past</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: hidden;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Conker's Bad Fur Day</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-03-21</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">Rare</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">Rare</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p data-block-id=\"9d3400dd-af96-4c34-94c3-f3e709e20354\" data-pm-slice=\"1 1 []\">I had previously played Conker's Bad Fur Day several times back when the N64 console was new. It was an excellent game back then and the good news is, it's still awesome! After a suggestion from chat, nostalgia kicked in and I immediately added it to the list.</p>\n<p data-block-id=\"97773f9f-2f97-40d7-87f8-bfcb89aaf703\" data-pm-slice=\"1 1 []\">Conker's BFD is an epic action-adventure/platformer released all the way back in 2001 (feel old yet?) featuring Conker, the red squirrel trying to find his way back home after a blinder down at the pub. Conker inevitably gets waylaid into numerous adventures across different biomes. Each with unique feels and game modes and ends up having one of those days.</p>\n<p data-block-id=\"8c6f4aec-a9ae-4375-aa00-cfe4dade947d\" data-pm-slice=\"1 1 []\">The game features many references to popular movies, games and memes of the time. It includes exceptional and often irreverent humour with plenty of well-chosen 4th wall breaks. It also features one of the most enjoyable boss fights in gaming.</p>\n<p data-block-id=\"7c6f12d9-7f71-42af-b794-73d04485a810\" data-pm-slice=\"1 1 []\">For this play through I used RetroArch with 8x upscaling. Native 240p N64 resolution doesn't work that well at 1440p, and an Xbox Elite controller. Once tweaked a bit, the game ran smoothly. Though being designed for the N64's single stick controller, it was a bit tricky to handle things like aiming.</p>\n<p data-block-id=\"00c7d6c3-31c8-45ae-9f11-e2ef66a97a7b\" data-pm-slice=\"1 1 []\">The audio was excellent and the graphics are reminiscent of Rare's other games such as Banjo-Kazooie. It stuttered a fair bit on RetroArch's default settings, but giving it a bit more made it run great.</p>\n<p data-block-id=\"33514cf0-655d-455a-8f54-2c6bda61879e\" data-pm-slice=\"1 1 []\">Conker's Bad Fur Day is definitely a brilliant game, well worth a play through and I enjoyed going back to it. On stream it took ~12.5 hours.</p>",
            "image": "https://www.gamertechau.com/media/posts/45/conkers-bad-fur-day.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Completed Games"
            ],
            "date_published": "2025-03-21T17:06:51+11:00",
            "date_modified": "2025-05-11T16:29:19+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/like-a-dragon-pirate-yakuza-in-hawaii/",
            "url": "https://www.gamertechau.com/posts/like-a-dragon-pirate-yakuza-in-hawaii/",
            "title": "Like a Dragon: Pirate Yakuza in Hawaii",
            "summary": "An epic adventure Name Like a Dragon: Pirate Yakuza in Hawaii Completed&hellip;",
            "content_html": "<h2>An epic adventure</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: hidden;\" border=\"1\">\n<tbody>\n<tr style=\"height: 48.0625px;\">\n<td style=\"width: 49.9288%; height: 48.0625px;\">Name</td>\n<td style=\"width: 49.9288%; height: 48.0625px;\">Like a Dragon: Pirate Yakuza in Hawaii</td>\n</tr>\n<tr style=\"height: 48.5625px;\">\n<td style=\"width: 49.9288%; height: 48.5625px;\">Completed on</td>\n<td style=\"width: 49.9288%; height: 48.5625px;\">2025-03-17</td>\n</tr>\n<tr style=\"height: 48.5625px;\">\n<td style=\"width: 49.9288%; height: 48.5625px;\">Developers</td>\n<td style=\"width: 49.9288%; height: 48.5625px;\">Ryu Ga Gotoku Studio</td>\n</tr>\n<tr style=\"height: 48.0625px;\">\n<td style=\"width: 49.9288%; height: 48.0625px;\">Publishers</td>\n<td style=\"width: 49.9288%; height: 48.0625px;\">SEGA</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>Like a Dragon: Pirate Yakuza in Hawaii is already my Game of the Year. Seriously, it's that good. If you like the Yakuza/Like a Dragon series, then get it. It's clear that the devs were allowed to have fun with it and it shows.</p>\n<p>This is going to be tricky to explain without spoilers as there's so much unique content, all with RGG's staple well-balanced humour let off the leash a little to match the main character's wild personality, but I'll do my best!</p>\n<p>Pirate Majima is a canon spin-off based after the events of LAD: Infinite Wealth (yes this game does have spoilers for IW, so play that first), you play long-time character Goro Majima who washes up on the beach of a tiny Hawaiian island having lost his memory (but not his booty kicking skills).</p>\n<p>Through a traditionally chaotic series of events, Majima takes command of a pirate sailing ship and explores Hawaii in the search for fun, treasure and (eventually) his memories.</p>\n<p>As you progress, you unlock crop and animal farming for obtaining cooking ingredients, ship upgrades, crew and customisation (more available from DLC), seemingly every minigame from previous Yakuza games plus new ones, music that you can play on your phone while sailing around and equipment that improves Majima's personal stats for on-foot combat.</p>\n<p>While sailing, you'll encounter hostile ships and battle them for loot and crew xp and is a extremely well designed system. Entering combat is seamless, targeting requires you to pay attention to the waves that bob your ship around as well as other environmental factors. You can also swap to deck view and explore the deck on foot, revive fallen comrades, or repair status impairments.</p>\n<p>Exploring on foot, you have the staple Yakuza real-time combat, not turn-based as in recent Like a Dragon games. With two stances to choose from, each focused on single-target or group combat and lots of skill upgrades purchasable using cash and reputation earned throughout the play through.</p>\n<p>On day one release, the game ran perfectly out of the box with no crashes, stutters, performance issues etc. It was also extremely well optimised so didn't need upscaling/fake frames to get a playable frame rate. The audio was also excellent. RGG certainly put a lot of effort into this spin-off and it has me really looking forward to Project Century which looks to be an entirely new IP.</p>\n<p>Like a Dragon: Pirate Yakuza in Hawaii is a seriously well-made game and if you're a fan of the series, is 100% a buy. Play through time with not-quite 100%'ing the game came to 47.7 hours.</p>",
            "image": "https://www.gamertechau.com/media/posts/44/like-a-dragon-pirate-yakuza.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Completed Games",
                   "Beat em Up"
            ],
            "date_published": "2025-03-17T14:23:00+11:00",
            "date_modified": "2025-05-06T10:30:12+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/dredge/",
            "url": "https://www.gamertechau.com/posts/dredge/",
            "title": "DREDGE",
            "summary": "These fish bite back Name DREDGE Completed on 2025-02-20 Developers Black Salt&hellip;",
            "content_html": "<h2>These fish bite back</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: hidden;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">DREDGE</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-02-20</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">Black Salt Games</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">Team 17</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>An extremely well-made game. Played with the Pale Reach and Iron Rig DLC.</p>\n<p>In DREDGE, you play a fisherman who accepted a job as an angler for a remote island chain. A nice peaceful job...Except this is a Lovecraft game.</p>\n<p>Putter around the ocean fishing up a huge (230) range of fish in different biomes to sell for income or to fill special orders, but be back before sundown as these fish bite back. There's a ton of hidden quests hidden around the map, plenty of NPC's to talk to with stories, most of whom need your help to find various fish and items.</p>\n<p>As you explore you find or unlock upgrades to your boat, including faster, more redundant motors (you'll need em), specialised fishing equipment that can operate in more areas, more powerful lights, more cargo space, etc. You don't need all of them to complete the game, but you will need a lot.</p>\n<p>You'll also find new hungry things interested in you (BIG goober fish), and natural events that don't mix well with your boat such as water spouts. Each biome has its own hazards and all of them increase your stress, which as it gets higher seems to attract more things to you.</p>\n<p>As the story progresses, you'll learn about and potentially encounter a number of cosmic horrors with plenty of Lovecraft-inspired lore to find.</p>\n<p>DREDGE ran perfectly with no noticeable issues and has a Platinum rating on ProtonDB. The audio was excellent and heightened the immersion of the game and the art style fit the mood perfectly. The devs put a lot of effort into it.</p>\n<p>Highly recommend giving this a go. The DLC if you get them are best played from the early-mid game rather than saving until the end to keep it balanced. Obtained the base game from an Epic freebie.</p>",
            "image": "https://www.gamertechau.com/media/posts/43/DREDGE.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Indie",
                   "Completed Games"
            ],
            "date_published": "2025-02-20T15:10:41+11:00",
            "date_modified": "2025-05-04T12:29:47+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/slime-rancher/",
            "url": "https://www.gamertechau.com/posts/slime-rancher/",
            "title": "Slime Rancher",
            "summary": "Chill exploration and slimes Name Slime Rancher Completed on 2025-02-14 Developers Monomi&hellip;",
            "content_html": "<h2>Chill exploration and slimes</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: hidden;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Slime Rancher</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-02-14</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">Monomi Park</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">Monomi Park</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>After playing Wolfenstein, this felt like a nice, chill game to veg out on.</p>\n<p>Slime Rancher is a fun exploration/adventure game based in the Far, Far Range, an area on a planet 1,000 light years away from Earth. As you explore you can collect different slimes, bring them back to your ranch and keep them in corrals, feeding and family-friendly breeding them to create hybrids. You then collect their 'plorts' and sell them on the market. Other uses open up as you progress.</p>\n<p>It's a sandbox game, so the objective is simply to progress your ranch and earn money while collecting limited lore scattered around the map. There are minor threats in game from the environment as well as some hostile slimes, but they don't really provide a challenge, more to add a bit to the 'life' as you explore.</p>\n<p>The player gets free reign to build up their ranch as they see fit and can eventually add cosmetics to their slimes (with a DLC adding additional cosmetics). There's multiple distinct areas to unlock to expand your ranch that favour specific types of slimes and eventual automation.</p>\n<p>The automation relies on drones you can research and construct then give them simple commands to auto-collect plorts, feed the slimes etc. In my opinion they could've been improved though. They only have enough fuel for one day of work, so each day you have to travel across your large farm to splash each drone base with water, or your slimes starve and riot, escaping their pens and creating chaos on the ranch.</p>\n<p>One unfortunate point was the game contains one of the most restrictive stamina systems I've ever seen. Even with your stamina limit fully upgraded, you run out within seconds and as the game relies a lot on platforming using both running and a very anaemic jetpack that both rapidly consume it, you regularly have to stand still and wait for your energy to recharge before you can continue. Stamina systems are designed to slow the player down so the game lasts longer, but there was no actual need for it in Slime Rancher due to the plentiful sandbox content and is just a painful annoyance. There were mods that affect it on Nexus, but none of them seem to function any more unfortunately.</p>\n<p>Performance, audio and art were all on point, with the game running perfectly with no stutters or frame drops.</p>\n<p>Overall, I recommend Slime Rancher for a chill game session however the stamina issue really was extremely painful, so keep that in mind. Hopefully Slime Rancher 2 improves on it dramatically.</p>",
            "image": "https://www.gamertechau.com/media/posts/42/SlimeRancher.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Indie",
                   "Completed Games"
            ],
            "date_published": "2025-02-14T16:27:26+11:00",
            "date_modified": "2025-05-04T12:32:23+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/wolfenstein-the-new-order/",
            "url": "https://www.gamertechau.com/posts/wolfenstein-the-new-order/",
            "title": "Wolfenstein: The New Order",
            "summary": "Time to save the world Name Wolfenstein: The New Order Completed on&hellip;",
            "content_html": "<h2>Time to save the world</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: none;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Wolfenstein: The New Order</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-02-05</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">MachineGames</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">Bethesda Softworks</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>Felt like playing this for...no particular reason. For younger viewers this is a mature-rated game with lots of dark scenes so keep that in mind.</p>\n<p>In an alternate 1946, you play William Blazkowicz, a US operative sent in to eliminate a mad scientist powering the bad guy regime by any means necessary. In an unfortunate series of events, you're seriously injured and taken out of the fight for 14 years. Long enough for the baddies to take over the world.</p>\n<p>Finally recovered in 1960, your objective is to find any remaining resistance and fight back against the oppressors utilising a variety of firearms and firearm-adjacent weaponry. Also knives. There's lots of sharp objects used in this game. Not always in ways you want.</p>\n<p>The story is excellent and takes you to multiple countries, the playable maps while simpler in layout than OG Wolfenstein easily puts modern AAA(A) map design to shame with multiple routes to choose from including the requisite sneaky-boi paths and verticality regularly comes into play. As Star Wars taught us, the high ground matters. There's also plenty of secrets and collectables should you explore.</p>\n<p>During the playthrough, you encounter a range of characters including resistance members, civilians, victims of the regime as well as really easy-to-hate members of said regime. The voice acting is excellent and were well-cast in my opinion.</p>\n<p>One annoying design choice was that the game consistently takes half your weapons and almost all of your ammunition at the start of each mission, even ones Will knows about well in advance and has plenty of time to prepare. There's plenty of ammo all over of course, however it does seem a bit of a weird choice that he'd knowingly go into battle with a single mag.</p>\n<p>The graphics were great, however there was a pretty extreme depth-of-field layer that can't be turned off without using the console, and it's noticeable why that is, as asset pop-in is extremely obvious when disabled and looking around. Unfortunately it's a shortcoming that does detract from the experience, though at least in more open maps, the pop-in isn't really noticeable. It's earned a Platinum rating on ProtonDB.</p>\n<p>If you're into complex FPS shooter games with solid stories (and over the age rating), I highly recommend giving Wolfenstein: The New Order a go. Got around 9.5 hours of playtime on stream.</p>",
            "image": "https://www.gamertechau.com/media/posts/41/WolfensteinTheNewOrder.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Completed Games"
            ],
            "date_published": "2025-02-05T17:19:13+11:00",
            "date_modified": "2025-05-04T12:35:10+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/yakuza-3-remastered/",
            "url": "https://www.gamertechau.com/posts/yakuza-3-remastered/",
            "title": "Yakuza 3 Remastered",
            "summary": "Old but gold Name Yakuza 3 Remastered Completed on 2025-01-31 Developers Ryu&hellip;",
            "content_html": "<h2>Old but gold</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: none;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Yakuza 3 Remastered</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-01-31</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">Ryu Ga Gotoku Studio</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">SEGA</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>Up front, Yakuza 3 is a remaster and port of the original 2009 PS3 game, it's not a remake like Yakuza Kiwami 1 &amp; 2. This means it's lacking a lot of quality of life improvements players would've gotten used to. It can be a bit of a shock to the system.</p>\n<p>Putting that aside, the story is of course up to RGG's excellent standard. A bit darker than the story in 0-2 it still has the depth and feels players know and love. Continuing off the story of Yakuza 2, we find Kiryu retired in Okinawa, Japan running an orphanage. It's a peaceful life until the Fire Na...uh... Yakuza attack.</p>\n<p>Kiryu then gets called out of retirement and is immediately back to punching people in the search for some peace and quiet. During the playthrough, you meet a lot of old friends, plus new ones. Everyone's a little older with new stories and a ton of substories, which are back to their usual lengths and depth compared to the much shorter ones in 2.</p>\n<p>Combat is simultaneously simpler and more complex. Enemies actually block or dodge, and have no trouble landing the hurt. The AI of Gun-wielding enemies is extremely limited. Generally they just stand there harmlessly unless you give them a long enough chance to do something. Using heat actions or grabs can be a bit painful as they're very picky about where you need to stand, how long you need to stand still and the option often vanishes before the enemy even starts moving out of the way.</p>\n<p>The lack of QoL features in this older game is highly noticeable, though thankfully doesn't detract from the story. You can't sprint outside of the chase minigame unlike previous games which is definitely noticeable as you have to run across town regularly. You can only order one thing at a time at restaurants/cafes/bars etc which makes it extremely slow if you're trying to complete the 'eat everything' achievements or heal a lot of health. The camera control is pretty annoying moving in tight spaces and especially combat. Inventory is back to limited slots and fills up extremely quickly.</p>\n<p>The game looks solid for the PS3 era and ran smoothly with no performance issues.</p>\n<p>If you're a fan of the Yakuza series, I highly recommend giving Yakuza 3 a go. Hopefully it'll get a Kiwami remake eventually, though at the time of writing, RGG's busy with Pirate Majima and Project Century, so might be a while.</p>",
            "image": "https://www.gamertechau.com/media/posts/40/Yakuza3Remastered.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Completed Games",
                   "Beat em Up"
            ],
            "date_published": "2025-01-31T18:25:56+11:00",
            "date_modified": "2025-05-06T10:30:07+10:00"
        },
        {
            "id": "https://www.gamertechau.com/posts/cat-detective-albert-wilde/",
            "url": "https://www.gamertechau.com/posts/cat-detective-albert-wilde/",
            "title": "Cat Detective Albert Wilde",
            "summary": "Let the fur fly Name Cat Detective Albert Wilde Completed on 2025-01-27&hellip;",
            "content_html": "<h2>Let the fur fly</h2>\n<table style=\"border-collapse: collapse; width: 100%; border-style: none;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 49.9288%;\">Name</td>\n<td style=\"width: 49.9288%;\">Cat Detective Albert Wilde</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Completed on</td>\n<td style=\"width: 49.9288%;\">2025-01-27</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Developers</td>\n<td style=\"width: 49.9288%;\">beyondthosehills</td>\n</tr>\n<tr>\n<td style=\"width: 49.9288%;\">Publishers</td>\n<td style=\"width: 49.9288%;\">beyondthosehills</td>\n</tr>\n</tbody>\n</table>\n<h3>Playthrough</h3>\n<p>Cat Detective Albert Wilde was a fun and unique detective game. Well worth playing.</p>\n<p>You play Albert Wilde, a broke feline private investigator in a noir prohibition-era US world of anthropomorphic animals who, in an effort to get a little scratch, stumbles on a big case that leads you around the city engaging with multiple interesting characters.</p>\n<p>Upfront, the game isn't intended to be a brain-melting investigation. The game focuses on the story and dry humour, so the investigative part of it is pretty simple. From their Steam page, the devs describe it as \"...something between a walking simulator and an interactive novel, with a strong emphasis on comedy\".</p>\n<p>The game is fairly linear. You can freely explore unlocked areas, however you can't progress with the story until you find all the key items or dialogue in that stage and it's extremely difficult to get lost. If you do, there's an effective journal in the form of actual notes written by Albert to point you where you need to go.</p>\n<p>It is a fairly short game. The devs state 6-7 hours, it took me 5.5 with talking to chat mixed in. Tech-wise it ran perfectly. One gripe is the game settings are only available after starting a new game and progressing past a reasonably loud opening cutscene with all the volume bars set default to 100%. Not ideal for a stream or headphones users. Settings should be available immediately, and volume should default to ~50% to allow players to adjust it without being deafened. It leaves an impression.</p>\n<p>Overall I enjoyed the play through and recommend checking it out.</p>",
            "image": "https://www.gamertechau.com/media/posts/39/CatDetectiveAlbertWilde.webp",
            "author": {
                "name": "GamertechAU"
            },
            "tags": [
                   "Indie",
                   "Completed Games"
            ],
            "date_published": "2025-01-27T17:09:21+11:00",
            "date_modified": "2025-05-04T12:42:42+10:00"
        }
    ]
}
